# 报关草单（预录入单）
preDecHead=['件数', '价格影响确认', '保费币制', '保费标记', '保费率', '公式定价确认', '净重', '出境关别', '包装种类', '合同协议号', '启运港', '境内收发货人名称', '境内收发货人海关代码', '境内收发货人社会信用代码', '境外收发货人', '备案号', '存放地点', '征免性质', '成交方式', '指运港', '提运单号', '支付特许权使用费确认', '暂定价格确认', '杂费币制', '杂费标记', '杂费率', '标记唛码及备注', '毛重', '特殊关系确认', '生产销售单位名称', '生产销售单位海关代码', '生产销售单位社会信用代码', '监管方式', '离境口岸', '自报自缴', '航次号', '许可证号', '贸易国', '运抵国', '运费币制', '运费标记', '运费率', '运输工具名称', '运输方式', '随附单证及编号', '页码页数']
preDecList=['净重单项', '单价', '原产国', '商品名称', '商品编号', '境内货源地', '币制', '征免', '总价', '成交单位', '成交数量', '最终目的国', '毛重单项', '法定第一数量', '法定第二数量', '规格型号']

# 合同
preDecHead=['保费币制', '保费标记', '保费率', '合同协议号', '境内收发货人名称', '境内收发货人海关代码', '境内收发货人社会信用代码', '境外收发货人', '备案号', '总价总和', '成交方式', '指运港', '生产销售单位名称', '生产销售单位海关代码', '生产销售单位社会信用代码', '贸易国', '运抵国', '运费币制', '运费标记', '运费率']
preDecList=['件数单项', '净重单项', '单价', '原产国', '商品名称', '商品编号', '境内货源地', '币制', '总价', '成交单位', '成交数量', '最终目的国', '毛重单项', '法定第一数量', '法定第二数量', '规格型号']
print(len(preDecHead) + len(preDecList))
# 发票
preDecHead=['保费币制', '保费标记', '保费率', '境内收发货人名称', '境内收发货人海关代码', '境内收发货人社会信用代码', '境外收发货人', '备案号', '总价总和', '成交方式', '指运港', '生产销售单位名称', '生产销售单位海关代码', '生产销售单位社会信用代码', '贸易国', '运抵国', '运费币制', '运费标记', '运费率']
preDecList=['件数单项', '净重单项', '单价', '原产国', '商品名称', '商品编号', '境内货源地', '币制', '总价', '成交单位', '成交数量', '最终目的国', '毛重单项', '法定第一数量', '法定第二数量', '规格型号']

# 装箱单
preDecHead=['件数', '净重', '包装种类', '境内收发货人名称', '境内收发货人海关代码', '境内收发货人社会信用代码', '境外收发货人', '备案号', '指运港', '毛重', '生产销售单位名称', '生产销售单位海关代码', '生产销售单位社会信用代码', '贸易国', '运抵国']
preDecList=['件数单项', '净重单项', '原产国', '商品名称', '商品编号', '境内货源地', '成交单位', '成交数量', '最终目的国', '毛重单项', '法定第一数量', '法定第二数量', '规格型号']
